In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:root@localhost/

In [3]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost/
(pymysql.err.OperationalError) (1046, 'No database selected')
[SQL: SHOW TABLES;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [8]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## SQL Types
### DDL (Data Definition Language)
    Define or modify the structure of the database
    * CREATE , ALTER , DROP , TRUNCATE , RENAME 
### DML (Data Manipulation Language)
    Manipulate the data stored in the database
    * SELECT , INSERT , UPDATE , DELETE
### DCL (Data Control Language)
    Control access to the data and database objects
    * GRANT (to give user access privilages)
    * REVOKE (to take away privilages)
### TCL (Transaction Control Language)
    Manage transactions within the database
    * COMMIT ( to save the transactions permanently)
    * ROLLBACK (Undo Transactions)
    * SAVEPOINT ( to set a point within a transaction to which you can roll back)

### DDL Commands

In [5]:
%%sql
create database abu;

 * mysql+pymysql://root:***@localhost/
(pymysql.err.ProgrammingError) (1007, "Can't create database 'abu'; database exists")
[SQL: create database abu;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [9]:
%%sql
show databases

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('abu',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

In [4]:
%%sql
use abu;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [13]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [14]:
%%sql
create table test(sno int , name varchar(100));

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [21]:
%%sql
insert into test(sno, name) values (1,'abu');

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[]

In [26]:
%%sql
select * from test;

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[(1, 'abu'), (1, 'abu')]

In [25]:
%%sql
update test set name='abu' where sno=1;

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[]

In [32]:
%%sql
delete from test where sno=1;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [30]:
%%sql
truncate test;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

### Creating tables in many ways

In [44]:
%%sql
-- Normal table creation
create table employees (
    employee_id int primary key,
    first_name varchar(50) not null,
    last_name varchar(50) not null,
    hire_date date not null,
    salary decimal(10,2)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [45]:
%%sql
-- CTAS (creating an table from the another table
create table high_paid_employees as
select
    employee_id ,
    first_name,
    last_name,
    salary
from employees
where salary > 60000;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [8]:
%%sql
-- temperory table creation (it is expired after the kill of the sessions or terminal)
create temporary table  temp_high_paid_employees as
select 
    employee_id,
    first_name
from employees;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [9]:
%%sql
select * from temp_high_paid_employees;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [10]:
%%sql
-- use instead of subquery 
WITH high_paid AS (
    SELECT *
    FROM employees
    WHERE salary > 60000
)
SELECT *
FROM high_paid;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

### Alter Command

In [5]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[('employees',), ('high_paid_employees',), ('test',)]

In [6]:
%%sql
desc employees;

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, '')]

In [7]:
%%sql
-- add the email column in the table
alter table employees add email varchar(100);

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [8]:
%%sql
desc employees;

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [9]:
%%sql
-- remove one column from the table
alter table employees drop last_name;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [10]:
%%sql
desc employees;

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [11]:
%%sql
-- change the table name
alter table employees rename to emp

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [12]:
%%sql
desc emp

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

### where (using uber test case)

In [14]:
%%sql
create database uber;

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[]

In [4]:
%%sql
use uber;

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [16]:
%%sql
create table rides(
    ride_id int,
    driver_id int,
    rider_id int ,
    pickup_location varchar(100),
    drop_location varchar(100),
    ride_date datetime,
    fare decimal(10,2)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [18]:
%%sql
INSERT INTO rides (
    ride_id,
    driver_id,
    rider_id,
    pickup_location,
    drop_location,
    ride_date,
    fare
)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00),
(2, 102, 202, 'Bangalore', 'Hyderabad', '2024-12-29 10:00:00', 800.00),
(3, 103, 203, 'Chennai', 'Madurai', '2024-12-29 12:00:00', 400.00),
(4, 104, 204, 'Coimbatore', 'Chennai', '2024-12-29 14:00:00', 600.00),
(5, 101, 205, 'Bangalore', 'Coimbatore', '2024-12-29 16:00:00', 700.00);

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[]

In [19]:
%%sql
select * from uber.rides;

 * mysql+pymysql://root:***@localhost/
5 rows affected.

[(1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00')),
 (2, 102, 202, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 29, 10, 0), Decimal('800.00')),
 (3, 103, 203, 'Chennai', 'Madurai', datetime.datetime(2024, 12, 29, 12, 0), Decimal('400.00')),
 (4, 104, 204, 'Coimbatore', 'Chennai', datetime.datetime(2024, 12, 29, 14, 0), Decimal('600.00')),
 (5, 101, 205, 'Bangalore', 'Coimbatore', datetime.datetime(2024, 12, 29, 16, 0), Decimal('700.00'))]

In [30]:
%%sql
-- above 500 rides

select * from rides
where fare >='500';  -- '50a', '500abc' â†’ auto-converted to 500 in some DBs

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[(1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00')),
 (2, 102, 202, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 29, 10, 0), Decimal('800.00')),
 (4, 104, 204, 'Coimbatore', 'Chennai', datetime.datetime(2024, 12, 29, 14, 0), Decimal('600.00')),
 (5, 101, 205, 'Bangalore', 'Coimbatore', datetime.datetime(2024, 12, 29, 16, 0), Decimal('700.00'))]

In [34]:
%%sql
-- above 500 rides and asecnding order , asc - acending , desc - decending

select * from rides
where fare >=500
order by fare desc;

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[(2, 102, 202, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 29, 10, 0), Decimal('800.00')),
 (5, 101, 205, 'Bangalore', 'Coimbatore', datetime.datetime(2024, 12, 29, 16, 0), Decimal('700.00')),
 (4, 104, 204, 'Coimbatore', 'Chennai', datetime.datetime(2024, 12, 29, 14, 0), Decimal('600.00')),
 (1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00'))]

In [37]:
%%sql
-- above 500 rides and chennai drop

select * from rides
where fare >=500 and drop_location='chennai'
order by fare desc;

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[(4, 104, 204, 'Coimbatore', 'Chennai', datetime.datetime(2024, 12, 29, 14, 0), Decimal('600.00'))]

### Keys or Constrains

In [41]:
%%sql
-- Primary Key
drop table rides;
create table rides(
    ride_id int primary key,
    driver_id int,
    rider_id int ,
    pickup_location varchar(100),
    drop_location varchar(100),
    ride_date datetime,
    fare decimal(10,2)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [42]:
%%sql
INSERT INTO rides (
    ride_id,
    driver_id,
    rider_id,
    pickup_location,
    drop_location,
    ride_date,
    fare
)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[]

In [43]:
%%sql
select * from rides;

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[(1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00'))]

In [44]:
%%sql
-- Composite Primary Key
drop table rides;
create table rides(
    ride_id int,
    driver_id int,
    rider_id int ,
    pickup_location varchar(100),
    drop_location varchar(100),
    ride_date datetime,
    fare decimal(10,2),
    primary key (ride_id,rider_id)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [45]:
%%sql
INSERT INTO rides (
    ride_id,
    driver_id,
    rider_id,
    pickup_location,
    drop_location,
    ride_date,
    fare
)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00),
(1, 101, 202, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[]

In [46]:
%%sql
select * from rides;

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[(1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00')),
 (1, 101, 202, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00'))]

In the above example the primary keys are two, if both the keys are same value is wont create other than we can able to create many duplicates 
the ride_id are same but the rider_id different then only it created

### Unique vs Primary key
* Unique creates unique values and it can allow the null values and also it wont allow any combinations based on this like the above example one column same but other one is not it wont allow
* Primary key creates unique values and does not allow the null values

In [50]:
%%sql
drop table user;
create table user(
    user_id int primary key,
    email varchar(50) unique
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [53]:
%%sql
insert into user(user_id,email)
values(1,'abu@gmail.com'),(2,NULL);

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[]

In [54]:
%%sql
select * from user;

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[(2, None), (1, 'abu@gmail.com')]

In [55]:
%%sql
insert into user(user_id,email)
values(3,NULL);

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[]

In [56]:
%%sql
select * from user;

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[(2, None), (3, None), (1, 'abu@gmail.com')]

In [59]:
%%sql

-- NOT NULL

drop table rides;
create table rides(
    ride_id int,
    driver_id int NOT NULL,
    rider_id int ,
    pickup_location varchar(100),
    drop_location varchar(100),
    ride_date datetime,
    fare decimal(10,2)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [60]:
%%sql
desc rides;

 * mysql+pymysql://root:***@localhost/
7 rows affected.

[('ride_id', 'int', 'YES', '', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('pickup_location', 'varchar(100)', 'YES', '', None, ''),
 ('drop_location', 'varchar(100)', 'YES', '', None, ''),
 ('ride_date', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, '')]

### Check Condition

In [61]:
%%sql

drop table rides;
create table rides(
    ride_id int,
    driver_id int NOT NULL,
    rider_id int ,
    pickup_location varchar(100),
    drop_location varchar(100),
    ride_date datetime,
    fare decimal(10,2) check (fare >0) -- the fare should be positive
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [62]:
%%sql
INSERT INTO rides (
    ride_id,
    driver_id,
    rider_id,
    pickup_location,
    drop_location,
    ride_date,
    fare
)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', -500.00);

 * mysql+pymysql://root:***@localhost/
(pymysql.err.OperationalError) (3819, "Check constraint 'rides_chk_1' is violated.")
[SQL: INSERT INTO rides (
    ride_id,
    driver_id,
    rider_id,
    pickup_location,
    drop_location,
    ride_date,
    fare
)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', -500.00);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

* Read the above error it shows the check condition violated

## Foreign Key

In [98]:
%%sql
drop table if exists drivers,rides;
create table drivers(
    driver_id int primary key,
    driver_name varchar(100),
    license_number varchar(50) unique
);

-- creating the rides table with driver_id as a foreign key 

create table rides(
    ride_id int primary key,
    driver_id int,
    pickup_location varchar(100),
    drop_location varchar(100),
    ride_date datetime,
    fare decimal(10,2),
    foreign key (driver_id) references drivers(driver_id)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [100]:
%%sql
desc rides;

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'YES', 'MUL', None, ''),
 ('pickup_location', 'varchar(100)', 'YES', '', None, ''),
 ('drop_location', 'varchar(100)', 'YES', '', None, ''),
 ('ride_date', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, '')]

In [102]:
%%sql
INSERT INTO drivers (driver_id, driver_name, license_number)
VALUES
(101, 'John Doe', 'XYZ12345'),
(102, 'Jane Smith', 'ABC67890');

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[]

In [104]:
%%sql
INSERT INTO rides (
    ride_id,
    driver_id,
    pickup_location,
    drop_location,
    ride_date,
    fare
)
VALUES
(301, 101, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00),
(302, 101, 'Chennai', 'Madurai', '2024-12-01 09:30:00', 600.00),
(303, 102, 'Bangalore', 'Hyderabad', '2024-12-02 10:00:00', 700.00);

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[]

In [105]:
%%sql
select * from rides;

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[(301, 101, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00')),
 (302, 101, 'Chennai', 'Madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00')),
 (303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 2, 10, 0), Decimal('700.00'))]

In [106]:
%%sql
select * from drivers;

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[(101, 'John Doe', 'XYZ12345'), (102, 'Jane Smith', 'ABC67890')]

In [108]:
%%sql
INSERT INTO rides (
    ride_id,
    driver_id,
    pickup_location,
    drop_location,
    ride_date,
    fare
)
VALUES
(304, 999, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00);

 * mysql+pymysql://root:***@localhost/
(pymysql.err.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`uber`.`rides`, CONSTRAINT `rides_ibfk_1` FOREIGN KEY (`driver_id`) REFERENCES `drivers` (`driver_id`))')
[SQL: INSERT INTO rides (
    ride_id,
    driver_id,
    pickup_location,
    drop_location,
    ride_date,
    fare
)
VALUES
(304, 999, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

* in the above shell the driver id 999 does not in the driver table then only this error came , the thing is to restrict the foreign key to directly insert to the main table (driver) from the connected table (riders)

In [110]:
%%sql
delete from drivers where driver_id = 102;

 * mysql+pymysql://root:***@localhost/
(pymysql.err.IntegrityError) (1451, 'Cannot delete or update a parent row: a foreign key constraint fails (`uber`.`rides`, CONSTRAINT `rides_ibfk_1` FOREIGN KEY (`driver_id`) REFERENCES `drivers` (`driver_id`))')
[SQL: delete from drivers where driver_id = 102;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

* we cant able to delete the row becoz it connected with the rides
* but use the 'on delete cascade' it allow to delete but where ever it having relations it delete the whole thing the example is in the below

In [112]:
%%sql
drop table if exists drivers,rides;
create table drivers(
    driver_id int primary key,
    driver_name varchar(100),
    license_number varchar(50) unique
);

-- creating the rides table with driver_id as a foreign key 

create table rides(
    ride_id int primary key,
    driver_id int,
    pickup_location varchar(100),
    drop_location varchar(100),
    ride_date datetime,
    fare decimal(10,2),
    foreign key (driver_id) references drivers(driver_id) on delete cascade 
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [113]:
%%sql
INSERT INTO drivers (driver_id, driver_name, license_number)
VALUES
(101, 'John Doe', 'XYZ12345'),
(102, 'Jane Smith', 'ABC67890');

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[]

In [114]:
%%sql
INSERT INTO rides (
    ride_id,
    driver_id,
    pickup_location,
    drop_location,
    ride_date,
    fare
)
VALUES
(301, 101, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00),
(302, 101, 'Chennai', 'Madurai', '2024-12-01 09:30:00', 600.00),
(303, 102, 'Bangalore', 'Hyderabad', '2024-12-02 10:00:00', 700.00);

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[]

In [115]:
%%sql
delete from drivers where driver_id = 102;

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[]

In [116]:
%%sql
select * from drivers;

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[(101, 'John Doe', 'XYZ12345')]

In [117]:
%%sql
select * from rides;

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[(301, 101, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00')),
 (302, 101, 'Chennai', 'Madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00'))]

## Default Keyword
* to assign the values during the creation of table

In [5]:
%%sql
create table test (
    country varchar(50) default 'inr',
    name varchar(100)
);

 * mysql+pymysql://root:***@localhost/
0 rows affected.

[]

In [6]:
%%sql
insert into test(name) values ('abu'),('thahi');

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[]

In [10]:
%%sql
insert into test(name,country) values ('abu','usa'),('thahi','dubai');

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[]

In [11]:
%%sql
select * from test;

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[('inr', 'abu'), ('inr', 'thahi'), ('usa', 'abu'), ('dubai', 'thahi')]

### Note
* Natural Key â†’ Comes from Nature (real world)
    * license_number VARCHAR(50) PRIMARY KEY
* Surrogate Key â†’ System-generated
    * driver_id INT AUTO_INCREMENT PRIMARY KEY

### Super Key 
* A Super Key is any column or group of columns that can uniquely identify a row in a table.
* All the values can seperately can also find the value uniquely
* Eg student_id,email,phone,student_id + email

### Candidate Key
* A Candidate Key is a minimal super key (minimal = no extra column).

### Primary Key
* A Primary Key is one chosen candidate key used as the main identifier.
* Rules:
    * Cannot be NULL
    * Must be unique
    * Only one primary key per table
### Composite Key
* A Composite Key is a key made using more than one column.
* Eg student_id + course_id âœ… unique

        | Key Type      | Meaning                   | Example                  |
        | ------------- | ------------------------- | ------------------------ |
        | Super Key     | Any unique identifier     | `email`, `id+email`      |
        | Candidate Key | Minimal unique identifier | `email`                  |
        | Primary Key   | Chosen candidate key      | `student_id`             |
        | Composite Key | Multiple columns as key   | `student_id + course_id` |